import 'package:connect1/widgets/item1.dart';
import 'package:connect1/widgets/item2.dart';
import 'package:connect1/widgets/item3.dart';
import 'package:connect1/widgets/line.dart';
import 'package:connect1/widgets/line1.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

import 'constant.dart';

class four_screen extends StatelessWidget {
  static String id = "four_screen";
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.white,
      appBar: AppBar(
        iconTheme: IconThemeData(
          color: main_color,
        ),
        backgroundColor: Colors.white,
        elevation: 0,
        title: Text("أفضل الأدعية الرمضانية",
            style: TextStyle(
                color: main_color,
                fontWeight: FontWeight.bold,
                fontFamily: "Lalezar")),
        centerTitle: true,
      ),
      body: SingleChildScrollView(
        child: Column(
          mainAxisAlignment: MainAxisAlignment.center,
          children: [
            SizedBox(height: 10),
            item1("دعاء الصائم عند إفطاره"),
            item2(
                "«ذهب الظمأ وابتلت العُروقُ وثبت الأجر يا واسع الفضل إن شاء الله» حسن [صحيح سنن أبي داود 449-2]، وابتلت العروق؛ أي تأكيد لذهاب الظمأ. وقد «كان رسول الله -صلى الله عليه وسلم- يفطر على رطبات قبل أن يصلي، فإن لم تكن رطبات فعلى تمرات، فإن لم تكن فيكون على الماء» حسن صحيح [صحيح سنن أبي داود 448-2]. قول الصائم إذا سبه أحد أو شاتمه: «اللهم إني صائم، إني صائم» متفق عليه"),
            line(),
            item1("دعاء وقت السحور"),
            item2(
                "بالنسبة لما يُقال وقت السحور؛ فليس هناك دعاء خاص يُقال، والمشروع هو أن تسمي الله في أول الطعام، وتحمده عند الانتهاء من تناوله كما تفعل على أي طعام، ولكن يُفضل أن تؤخر السحور إلى وقت متأخر من الليل، في الثلث الأخير منه؛ لأنه وقت النزول الإلهي، وهو وقت استجابة الدعاء. وقد جاء عن أبي هريرة أن رسول الله -صلى الله عليه وسلم- قال: «يَنْزِلُ رَبُّنَا تَبَارَكَ وتَعَالَى كُلَّ لَيْلَة إِلَى السَّمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الآخِرُ يَقُولُ: مَنْ يَدْعُونِي فَأستجيبَ لَهُ، مَنْ يَسْأَلُنِي فَأُعْطِيَهُ، مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَه» [رواه البخاري (1094) ومسلم (758)]"),
            line(),
            item1("دعاء الأيام العشرة الأوائل"),
            item2(
                "أشهد أن لا إله إلا الله، وأستغفر الله، اللهم إني أسألك الجنة، وأعوذ بك من النار"),
            line(),
            item1("دعاء العشرة الثانية"),
            item2("اللهم إني أسألك برحمتك التي وسعت كل شيء أن تغفر لي"),
            line(),
            item1("دعاء العشرة الأخيرة"),
            item2(
                "من أهم أدعية شهر رمضان «اللهم إنك عفو كريم تحب العفو فاعفُ عني»"),
            line(),
            item1("أدعية شهر رمضان تُقال في أي ساعة"),
            item2(
                "اللهم قد حضر أول يوم -أو ثاني يوم أو ثالث يوم وهكذا- من شهر رمضان، وقد فرضت علينا صيامه، وأنزلت فيه القرآن هدى للناس وبينات من الهدى والفرقان؛ فاللهم أعنَّا على صيامه وقيامه، وتقبله منا، يا أكرم الأكرمين، إنك على كل شيء قدير. اللهم قربني فيه إلى مرضاتك، وجنبني فيه من سخطك ونقماتك، ووفقني فيه لقراءة آياتك، برحمتك يا أرحم الراحمين"),
            line1(),
            item2(
                "اللهم زيّني فيه بالستر والعفاف، واسترني فيه بلباس القنوع والكفاف، واحملني فيه على العدل والإنصاف، وأمّني فيه من كل ما أخاف بعصمتك يا عصمة الخائفين، وارزقني فيه ذكرك دائماً، بتوفيقك يا هادي الضالين"),
            line1(),
            item2(
                "من أجمل أدعية شهر رمضان: «اللهم أعني فيه على صيامه وعلى قيامه، وجنبني فيه من هفواتي وآثامي، وارزفي فيه ذكرك دائماً يا رب العالمين»"),
            line1(),
            item2(
                "اللهم طهرني فيه من الدنس والأقذار، وصبرني فيه على كائنات الأقدار، ووفقني فيه للتُّقَى وصحبة الأبرار، بعونك يا قرة عين المساكين"),
            line1(),
            item2(
                "اللهم اغسلني فيه من الذنوب وطهرني فيه من العيوب، وامتحن قلبي فيه بتقوى القلوب، يا غافر عثرات المذنبين. اللهم اجعل سعيي فيه مشكوراً، وذنبي فيه مغفوراً، وعملي فيه مقبولاً، وعيبي فيه مستوراً، يا أسمع السامعين. اللهم افتح لي فيه أبواب الجنان، وأغلق عني أبواب النيران، ووفقني فيه لقراءة القرآن، يا منزل السكينة في قلوب المؤمنين"),
            line1(),
            item2(
                "اللهم وفِّر حظي فيه من النوافل، وأكرمني فيه بإحضار المسائل، وقرب فيه وسيلتي إليك من بين الوسائل، يا من لا يشغله إلحاح الملحّين. اللهم ارزقني فيه فضل ليلة القدر، وسير أموري فيه من العسر إلى اليسر، واقبل معاذيري، وحُطَّ عني الذنب والوزر، يا رءوفاً بعبادك الصالحين. اللهم ارزقني فيه الذهن والتنبه، وباعد فيه بيني وبين السفاهة والتمويه، واجعل لي نصيباً من كل خير تنزله بجودك وكرمك يا أجود الأجودين"),
            line1(),
            item2(
                "من أجمل أدعية شهر رمضان: «اللهم افتح لي أبواب فضلك، وأنزل عليَّ فيه بركاتك. ووفقني فيه لموجبات مرضاتك، وأسكني فيه بحبوحات جناتك، يا مجيب دعوة المضطرين». اللهم اغمرني فيه بالرحمة، وارزقني فيه التوفيق والعصمة، وطهر غياهب قلبي من التهمة، يا رحيماً بعبادك المؤمنين. اللهم اجعل صيامي فيه بالشكر والقبول، وعلى ما ترضاه ويرضاه الرسول، وصلِّ اللهم على سيدنا محمد وعلى آله وصحبه أجمعين"),
            line1(),
            item2(
                "اللهم أعني على صيامه وقيامه بتوفيقك، يا هادي الضالين، وقربني إليك برحمة الأيتام، وإطعام الطعام، وإفشاء السلام، وصحبة الكرام. اَللّهُمَّ اجْعَل لي فيهِ نَصيباً مِن رَحمَتِكَ الواسِعَة، واهْدِني فيهِ لِبَراهينِكَ السّاطِعَة، وخُذْ بِناصِيَتي إلى مَرْضاتِكَ الجامِعَة بِمَحَبَّتِكَ يا أَمَلَ المُشتاقينَ. اَللّهُمَّ اجْعَلني فيهِ مِنَ المُتَوَكِلينَ عَلَيْكَ، واجْعَلني فيهِ مِنَ الفائِزينَ لَدَيْكَ، واجعَلني فيه مِنَ المُقَرَّبينَ إليكَ بِإحْسانِكَ يا غايَة الطّالبينَ"),
            line1(),
            item2(
                "اَللّهُمَّ حَبب إليَّ فيهِ الْإحسانَ، وكَرِّهْ إليَّ فيهِ الْفُسُوقَ والعِصيانَ، وحَرِّمْ عَلَيَّ فيهِ السَخَطَ والنّيرانَ، بعَوْنِكَ يا غياثَ المُستَغيثينَ. اَللّهُمَّ اجعَلني فيهِ مِنَ المُستَغْفِرينَ، واجعَلني فيهِ مِن عِبادِكَ الصّالحينَ القانِتينَ، واجعَلني فيهِ مِن أوْليائِكَ المُقَرَّبينَ، بِرَأفَتِكَ يا اَرحَمَ الرّاحمينَ"),
            SizedBox(height: 20)
          ],
        ),
      ),
    );
  }
}
